CSI API ETABS v1
cEditGeneral.Move Method
 Moves selected point, frame, cable, tendon, area, solid and link objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Move(
	double DX,
	double DY,
	double DZ
)
Function Move (
	DX As Double,
	DY As Double,
	DZ As Double
) As Integer
Dim instance As cEditGeneral
Dim DX As Double
Dim DY As Double
Dim DZ As Double
Dim returnValue As Integer
returnValue = instance.Move(DX, DY, DZ)
int Move(
	double DX,
	double DY,
	double DZ
)
abstract Move :
        DX : float *
        DY : float *
        DZ : float -> int
Parameters
DX
Type: System.Double
 This is the x offset used, in the present coordinate system, for moving the selected objects.
DY
Type: System.Double
 This is the y offset used, in the present coordinate system, for moving the selected objects.
DZ
Type: System.Double
 This is the z offset used, in the present coordinate system, for moving the selected objects.
Return Value
Type: Int32
 Returns zero if the move is successful; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'move objects
       ret = SapModel.SelectObj.ClearSelection
       ret = SapModel.PointObj.SetSelected("8", True)
       ret = SapModel.PointObj.SetSelected("16", True)
       ret = SapModel.FrameObj.SetSelected("74", True)
       ret = SapModel.PointObj.SetSelected("92", True)
       ret = SapModel.PointObj.SetSelected("91", True)
       ret = SapModel.FrameObj.SetSelected("166", True)
       ret = SapModel.EditGeneral.Move(0, 0, -36)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cEditGeneral Interface
ETABSv1 Namespace